{"class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_381", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 53, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 17]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_381"}}, {"class_name": "Dropout", "config": {"rate": 0.1866149810476416, "trainable": true, "name": "dropout_381"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_382", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 90, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 18]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_382"}}, {"class_name": "Dropout", "config": {"rate": 0.1866149810476416, "trainable": true, "name": "dropout_382"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_383", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 92, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 19]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_383"}}, {"class_name": "Dropout", "config": {"rate": 0.1866149810476416, "trainable": true, "name": "dropout_383"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_384", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 89, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 17]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_384"}}, {"class_name": "Dropout", "config": {"rate": 0.1866149810476416, "trainable": true, "name": "dropout_384"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_96", "trainable": true, "data_format": "channels_first", "pool_size": [1, 21], "padding": "valid", "strides": [1, 21]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_96"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_96", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "backend": "theano"}