{"class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_109", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 97, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 16]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_109"}}, {"class_name": "Dropout", "config": {"rate": 0.13796731403315787, "trainable": true, "name": "dropout_109"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_110", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 84, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 17]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_110"}}, {"class_name": "Dropout", "config": {"rate": 0.13796731403315787, "trainable": true, "name": "dropout_110"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_111", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 82, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 16]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_111"}}, {"class_name": "Dropout", "config": {"rate": 0.13796731403315787, "trainable": true, "name": "dropout_111"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_112", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 74, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 15]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_112"}}, {"class_name": "Dropout", "config": {"rate": 0.13796731403315787, "trainable": true, "name": "dropout_112"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_28", "trainable": true, "data_format": "channels_first", "pool_size": [1, 14], "padding": "valid", "strides": [1, 14]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_28"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "backend": "theano"}